{
  "Cart": [
    {"id": "C-001", "text": "Check adding a single product to the cart from product page."},
    {"id": "C-002", "text": "Check adding multiple products to the cart from different pages."},
    {"id": "C-003", "text": "Check quantity update (max/min limits and invalid inputs)."},
    {"id": "C-004", "text": "Check removing a single product from the cart."},
    {"id": "C-005", "text": "Check clearing the entire cart."},
    {"id": "C-006", "text": "Check correct calculation of subtotal, taxes, shipping, and total."},
    {"id": "C-007", "text": "Check applying discount codes or promo codes."},
    {"id": "C-008", "text": "Check cart retention after page refresh."},
    {"id": "C-009", "text": "Check cart retention after logout/login (for registered users)."},
    {"id": "C-010", "text": "Check stock validation: cannot add more items than available."},
    {"id": "C-011", "text": "Check checkout button redirects to correct checkout page."},
    {"id": "C-012", "text": "Check responsive design on mobile, tablet, and desktop."},
    {"id": "C-013", "text": "Check cart updates correctly when removing or adding products during checkout."},
    {"id": "C-014", "text": "Check behavior when session expires with items in the cart."},
    {"id": "C-015", "text": "Check performance: cart updates and page load time."}
  ],
  "Register": [
        {"id": "R-001", "text": "Check mandatory field validation (empty fields)."},
    {"id": "R-002", "text": "Check password minimum requirements (length, uppercase, special characters)."},
    {"id": "R-003", "text": "Check email format validation (invalid email addresses)."},
    {"id": "R-004", "text": "Check email uniqueness (registration with an existing user's email)."},
    {"id": "R-005", "text": "Check automatic login/redirect to the main page after successful registration."},
    {"id": "R-006", "text": "Check password confirmation matches password field."},
    {"id": "R-007", "text": "Check terms and conditions checkbox is mandatory before registration."},
    {"id": "R-008", "text": "Check registration via social login options (Google, Facebook, etc.)."},
    {"id": "R-009", "text": "Check validation messages are displayed properly for each invalid input."},
    {"id": "R-010", "text": "Check CAPTCHA functionality if available during registration."},
    {"id": "R-011", "text": "Check email verification link is sent and works correctly."},
    {"id": "R-012", "text": "Check registration form is responsive on mobile, tablet, and desktop."},
    {"id": "R-013", "text": "Check form handles special characters in name fields correctly."},
    {"id": "R-014", "text": "Check error handling when server is down or slow during registration."}
  ],
  "Authorization": [
    {"id": "A-001", "text": "Check login with correct credentials."},
    {"id": "A-002", "text": "Check login with incorrect password."},
    {"id": "A-003", "text": "Check login with non-existent email/username."},
    {"id": "A-004", "text": "Check login with empty fields (email/username and password)."},
    {"id": "A-005", "text": "Check the 'Remember Me' functionality keeps the user logged in after browser close."},
    {"id": "A-006", "text": "Check 'Forgot Password' functionality sends reset email correctly."},
    {"id": "A-007", "text": "Check login with social accounts (Google, Facebook, etc.) if available."},
    {"id": "A-008", "text": "Check account lockout after multiple failed login attempts."},
    {"id": "A-009", "text": "Check password visibility toggle (show/hide password) works correctly."},
    {"id": "A-010", "text": "Check error messages are displayed correctly for invalid login attempts."},
    {"id": "A-011", "text": "Check login page is responsive on mobile, tablet, and desktop."},
    {"id": "A-012", "text": "Check user is redirected to the correct page after login (home/dashboard)."},
    {"id": "A-013", "text": "Check logout functionality works and session is destroyed."},
    {"id": "A-014", "text": "Check session expires after a certain inactivity period."}
  ],
  "Search": [
    {"id": "S‑001", "text": "Verify that the search box is present and visible on all relevant pages."},
    {"id": "S‑002", "text": "Check that placeholder text is correct in the search input."},
    {"id": "S‑003", "text": "Verify user can type input into the search field."},
    {"id": "S‑004", "text": "Verify search can be triggered by pressing the Enter key."},
    {"id": "S‑005", "text": "Verify search can be triggered by clicking the search button/icon."},
    {"id": "S‑006", "text": "Test search with a valid single keyword and check results are relevant."},
    {"id": "S‑007", "text": "Test search with multiple words (phrases) and check results."},
    {"id": "S‑008", "text": "Test search with special characters (e.g. “C++”, “&”, “#”)."},
    {"id": "S‑009", "text": "Test search with numeric input (e.g. model names, years)."},
    {"id": "S‑010", "text": "Test search with leading/trailing whitespace and verify trimming behavior."},
    {"id": "S‑011", "text": "Test search with mixed case (uppercase/lowercase) and ensure case insensitivity works."},
    {"id": "S‑012", "text": "Verify autocomplete or suggestion dropdown appears (if implemented)."},
    {"id": "S‑013", "text": "Verify suggestions in autocomplete are relevant to input."},
    {"id": "S‑014", "text": "Test search with a misspelled word and check for “Did you mean” suggestions."},
    {"id": "S‑015", "text": "Check search result relevance ranking (most relevant first)."},
    {"id": "S‑016", "text": "Verify pagination of search results (if there are many results)."},
    {"id": "S‑017", "text": "Verify filters or facets (e.g., category, price) work with search results (for e‑commerce)."},
    {"id": "S‑018", "text": "Check performance: measure response time for issuing a search query."},
    {"id": "S‑019", "text": "Test no-results scenario: search for something that has no matches and verify proper message."},
    {"id": "S‑020", "text": "Verify that search history is stored / displayed (if the feature exists)."},
    {"id": "S‑021", "text": "Test the maximum length of input allowed in the search box."},
    {"id": "S‑022", "text": "Check behavior when entering very long search strings."},
    {"id": "S‑023", "text": "Check cross-browser compatibility for search functionality."},
    {"id": "S‑024", "text": "Test localization: search with input in different languages / character sets."},
    {"id": "S‑025", "text": "Verify security: search input should not allow injection (SQL, script, etc.)."},
    {"id": "S‑026", "text": "Verify UI and usability: search box is responsive on mobile / tablet / desktop."},
    {"id": "S‑027", "text": "Check that clicking a search result navigates to the correct page / product."},
    {"id": "S‑028", "text": "Verify that search suggestions / history can be cleared or deleted (if allowed)."}
  ],
   "Sort": [
    {"id": "SO-001", "text": "Verify sorting options (e.g., Price Low to High, Price High to Low, Newest, Popular) are visible."},
    {"id": "SO-002", "text": "Check that default sorting is applied correctly on page load."},
    {"id": "SO-003", "text": "Verify sorting by price (Low to High) displays items in correct order."},
    {"id": "SO-004", "text": "Verify sorting by price (High to Low) displays items in correct order."},
    {"id": "SO-005", "text": "Verify sorting by newest arrivals displays latest items first."},
    {"id": "SO-006", "text": "Verify sorting by popularity displays items correctly."},
    {"id": "SO-007", "text": "Check sorting works correctly with filters applied."},
    {"id": "SO-008", "text": "Check sorting works correctly after a search query."},
    {"id": "SO-009", "text": "Verify that changing the sort option updates the results immediately or after applying."},
    {"id": "SO-010", "text": "Check sorting works correctly with paginated results."},
    {"id": "SO-011", "text": "Verify sorting UI is responsive on mobile, tablet, and desktop."},
    {"id": "SO-012", "text": "Verify correct handling of items with the same value in the sorting criteria (e.g., same price)."},
    {"id": "SO-013", "text": "Check that sorting persists when navigating back and forth on the page."},
    {"id": "SO-014", "text": "Verify sorting works correctly when multiple criteria are selected (if multi-sort is allowed)."},
    {"id": "SO-015", "text": "Verify that invalid or unsupported sort options are handled gracefully."}
  ],
    "Filter": [
    {"id": "F-001", "text": "Verify all available filters (e.g., category, price, brand, rating) are visible."},
    {"id": "F-002", "text": "Check that filters can be selected individually and display correct results."},
    {"id": "F-003", "text": "Check that multiple filters can be applied simultaneously and results update correctly."},
    {"id": "F-004", "text": "Verify clearing a single filter updates results correctly."},
    {"id": "F-005", "text": "Verify clearing all filters resets results to default view."},
    {"id": "F-006", "text": "Check filter options reflect available items (e.g., no empty results when filter selected)."},
    {"id": "F-007", "text": "Verify that filter selections are retained when navigating between pages (pagination)."},
    {"id": "F-008", "text": "Check filter selections are retained after page refresh (if required)."},
    {"id": "F-009", "text": "Check that filter labels and values are displayed correctly."},
    {"id": "F-010", "text": "Check price range filters allow selecting min/max values correctly."},
    {"id": "F-011", "text": "Verify color, size, or other attribute filters update results correctly."},
    {"id": "F-012", "text": "Check filters work correctly in combination with sorting."},
    {"id": "F-013", "text": "Check filters work correctly in combination with search queries."},
    {"id": "F-014", "text": "Verify UI responsiveness of filter options on mobile, tablet, and desktop."},
    {"id": "F-015", "text": "Verify edge cases: filters return no results and display appropriate message."},
    {"id": "F-016", "text": "Check performance: applying filters updates results quickly."},
    {"id": "F-017", "text": "Verify that filters do not allow invalid selections or values."}
  ],
   "ContactUs": [
    {"id": "CU-001", "text": "Verify the Contact Us form is accessible from all relevant pages."},
    {"id": "CU-002", "text": "Check all required fields are present: Name, Email, Subject, Message, etc."},
    {"id": "CU-003", "text": "Verify mandatory field validation: submitting empty fields shows error messages."},
    {"id": "CU-004", "text": "Check email field validation (invalid email formats are rejected)."},
    {"id": "CU-005", "text": "Verify that special characters are allowed/handled correctly in Name and Message fields."},
    {"id": "CU-006", "text": "Check maximum character limits for each input field."},
    {"id": "CU-007", "text": "Verify that the Submit button sends the form successfully when inputs are valid."},
    {"id": "CU-008", "text": "Check confirmation message appears after successful submission."},
    {"id": "CU-009", "text": "Check that submitting the form triggers email notification to admin (if implemented)."},
    {"id": "CU-010", "text": "Verify reset/clear button works correctly (if present)."},
    {"id": "CU-011", "text": "Verify CAPTCHA works correctly (if implemented)."},
    {"id": "CU-012", "text": "Check UI responsiveness on desktop, tablet, and mobile."},
    {"id": "CU-013", "text": "Check error handling when server is down or network fails during submission."},
    {"id": "CU-014", "text": "Verify that form prevents SQL injection or script injection attempts."},
    {"id": "CU-015", "text": "Check accessibility features: labels, tab navigation, screen readers."}
  ],
   "Subscribe": [
    {"id": "SUB-001", "text": "Verify the subscription input field is visible and accessible."},
    {"id": "SUB-002", "text": "Check placeholder text in the subscription input is correct."},
    {"id": "SUB-003", "text": "Verify that user can type a valid email into the subscription field."},
    {"id": "SUB-004", "text": "Check mandatory field validation: empty email field shows an error."},
    {"id": "SUB-005", "text": "Verify email format validation: invalid email addresses are rejected."},
    {"id": "SUB-006", "text": "Check that the Subscribe button is clickable and triggers subscription."},
    {"id": "SUB-007", "text": "Verify successful subscription shows a confirmation message."},
    {"id": "SUB-008", "text": "Check that duplicate subscriptions (same email) are handled correctly."},
    {"id": "SUB-009", "text": "Verify email is added to the subscription database/list."},
    {"id": "SUB-010", "text": "Check unsubscription or opt-out link works correctly (if applicable)."},
    {"id": "SUB-011", "text": "Verify UI responsiveness on desktop, tablet, and mobile."},
    {"id": "SUB-012", "text": "Check security: prevent script injection via the email input field."},
    {"id": "SUB-013", "text": "Verify confirmation email is sent (if system sends one)."},
    {"id": "SUB-014", "text": "Check error handling when the server is down or network fails."}
  ],
   "Navigation": [
    {"id": "NAV-001", "text": "Verify main navigation menu is visible on all pages."},
    {"id": "NAV-002", "text": "Check all menu items are clickable and redirect to correct pages."},
    {"id": "NAV-003", "text": "Verify dropdown menus open on hover or click as expected."},
    {"id": "NAV-004", "text": "Check that active page/menu item is highlighted correctly."},
    {"id": "NAV-005", "text": "Verify breadcrumb navigation is visible and correct (if implemented)."},
    {"id": "NAV-006", "text": "Check mobile menu (hamburger) opens and closes correctly."},
    {"id": "NAV-007", "text": "Verify menu items are accessible via keyboard navigation (Tab key)."},
    {"id": "NAV-008", "text": "Check responsive design: menu displays properly on desktop, tablet, and mobile."},
    {"id": "NAV-009", "text": "Verify navigation links work correctly after page refresh."},
    {"id": "NAV-010", "text": "Check that broken links in navigation are not present."},
    {"id": "NAV-011", "text": "Verify external links (if any) open in new tabs/windows as expected."},
    {"id": "NAV-012", "text": "Check navigation works correctly in different browsers."},
    {"id": "NAV-013", "text": "Verify search icon/navigation shortcuts (if present) function correctly."},
    {"id": "NAV-014", "text": "Check user role-based navigation (if applicable) displays correct menu items."},
    {"id": "NAV-015", "text": "Verify sticky navigation (if implemented) remains visible while scrolling."}
  ],
  "ResponsiveDesign": [
    {"id": "RD-001", "text": "Verify that the website layout adjusts correctly on desktop, tablet, and mobile devices."},
    {"id": "RD-002", "text": "Check that all images resize properly without distortion on different screen sizes."},
    {"id": "RD-003", "text": "Verify navigation menus adapt correctly (e.g., hamburger menu on mobile)."},
    {"id": "RD-004", "text": "Check that buttons and clickable elements are easily tappable on mobile devices."},
    {"id": "RD-005", "text": "Verify text content is readable without horizontal scrolling on all screen sizes."},
    {"id": "RD-006", "text": "Check that forms (input fields, checkboxes, dropdowns) display correctly and are usable."},
    {"id": "RD-007", "text": "Verify that modals, pop-ups, and tooltips are displayed correctly on all devices."},
    {"id": "RD-008", "text": "Check responsiveness of tables, lists, and grids."},
    {"id": "RD-009", "text": "Verify responsive images and media queries work correctly."},
    {"id": "RD-010", "text": "Check that footer and header elements remain visible and properly aligned."},
    {"id": "RD-011", "text": "Verify that interactive elements (sliders, carousels) work correctly on touch devices."},
    {"id": "RD-012", "text": "Check font sizes and line spacing are readable on small screens."},
    {"id": "RD-013", "text": "Verify that the website does not break in portrait and landscape orientations."},
    {"id": "RD-014", "text": "Check responsive behavior on different browsers and operating systems."},
    {"id": "RD-015", "text": "Verify performance and loading speed remain acceptable on mobile devices."}
  ],
   "BrowserCompatibility": [
    {"id": "BC-001", "text": "Verify the website loads correctly in Google Chrome (latest version)."},
    {"id": "BC-002", "text": "Verify the website loads correctly in Mozilla Firefox (latest version)."},
    {"id": "BC-003", "text": "Verify the website loads correctly in Microsoft Edge (latest version)."},
    {"id": "BC-004", "text": "Verify the website loads correctly in Safari (latest version, macOS/iOS)."},
    {"id": "BC-005", "text": "Verify the website loads correctly in Opera (latest version)."},
    {"id": "BC-006", "text": "Check that all UI elements render consistently across browsers."},
    {"id": "BC-007", "text": "Verify that interactive elements (buttons, links, forms) work correctly in all browsers."},
    {"id": "BC-008", "text": "Check that responsive design behaves consistently in all browsers."},
    {"id": "BC-009", "text": "Verify that images, icons, and fonts display correctly in all browsers."},
    {"id": "BC-010", "text": "Check that JavaScript functionalities (sliders, pop-ups, modals) work in all browsers."},
    {"id": "BC-011", "text": "Verify that CSS styles are applied consistently across browsers."},
    {"id": "BC-012", "text": "Check compatibility with older versions of major browsers if required."},
    {"id": "BC-013", "text": "Verify that external plugins (if any) work in all browsers."},
    {"id": "BC-014", "text": "Check performance and loading speed in different browsers."},
    {"id": "BC-015", "text": "Verify that error messages and notifications display consistently across browsers."}
  ],
   "Accessibility": [
    {"id": "AC-001", "text": "Verify all images have appropriate alt text for screen readers."},
    {"id": "AC-002", "text": "Check that all form fields have proper labels associated."},
    {"id": "AC-003", "text": "Verify keyboard navigation works for all interactive elements (links, buttons, forms)."},
    {"id": "AC-004", "text": "Check that focus indicators are visible when navigating with keyboard."},
    {"id": "AC-005", "text": "Verify color contrast ratios meet WCAG standards for readability."},
    {"id": "AC-006", "text": "Check that ARIA roles, properties, and landmarks are implemented correctly."},
    {"id": "AC-007", "text": "Verify that skip-to-content links are available and functional."},
    {"id": "AC-008", "text": "Check that dynamic content updates are announced to screen readers."},
    {"id": "AC-009", "text": "Verify headings (h1-h6) are used correctly and in proper hierarchy."},
    {"id": "AC-010", "text": "Check that videos have captions or transcripts available."},
    {"id": "AC-011", "text": "Verify that interactive elements are accessible via assistive technologies."},
    {"id": "AC-012", "text": "Check that text can be resized up to 200% without loss of content or functionality."},
    {"id": "AC-013", "text": "Verify that error messages are descriptive and programmatically associated with fields."},
    {"id": "AC-014", "text": "Check that no content is blinking or flashing in a way that could trigger seizures."},
    {"id": "AC-015", "text": "Verify the website meets WCAG 2.1 AA accessibility standards."}
  ],
   "Usability": [
    {"id": "U-001", "text": "Verify that the website layout is intuitive and easy to navigate."},
    {"id": "U-002", "text": "Check that menus, links, and buttons are clearly labeled and understandable."},
    {"id": "U-003", "text": "Verify that important actions (e.g., checkout, registration) are easy to find."},
    {"id": "U-004", "text": "Check consistency of design elements (colors, fonts, button styles) across pages."},
    {"id": "U-005", "text": "Verify that forms have clear instructions and field labels."},
    {"id": "U-006", "text": "Check that error messages are clear, informative, and actionable."},
    {"id": "U-007", "text": "Verify that page loading time is acceptable and does not frustrate users."},
    {"id": "U-008", "text": "Check that important content is visible without excessive scrolling."},
    {"id": "U-009", "text": "Verify that navigation flow is logical and supports user tasks efficiently."},
    {"id": "U-010", "text": "Check that interactive elements provide feedback when clicked or hovered."},
    {"id": "U-011", "text": "Verify that call-to-action buttons are prominent and stand out."},
    {"id": "U-012", "text": "Check that instructions, labels, and messages use simple, understandable language."},
    {"id": "U-013", "text": "Verify that users can easily recover from mistakes (undo, edit, delete)."},
    {"id": "U-014", "text": "Check that frequently used features are easy to access and use."},
    {"id": "U-015", "text": "Verify usability across devices: desktop, tablet, and mobile."}
  ],
   "Performance": [
    {"id": "P-001", "text": "Verify page load times are within acceptable limits (e.g., < 3 seconds)."},
    {"id": "P-002", "text": "Check website performance under normal user load."},
    {"id": "P-003", "text": "Check website performance under peak/high user load (stress testing)."},
    {"id": "P-004", "text": "Verify response times for key actions: search, add to cart, checkout, login."},
    {"id": "P-005", "text": "Check database queries do not cause slowdowns."},
    {"id": "P-006", "text": "Verify caching mechanisms work correctly to improve load times."},
    {"id": "P-007", "text": "Check server response time for static and dynamic content."},
    {"id": "P-008", "text": "Verify performance on different browsers and devices."},
    {"id": "P-009", "text": "Check image and media optimization to reduce page load time."},
    {"id": "P-010", "text": "Verify third-party scripts do not significantly affect performance."},
    {"id": "P-011", "text": "Check page rendering performance during simultaneous user actions."},
    {"id": "P-012", "text": "Verify scalability: website can handle increasing number of users or requests."},
    {"id": "P-013", "text": "Check performance during large data uploads or downloads (if applicable)."},
    {"id": "P-014", "text": "Verify network latency and bandwidth handling for different connection speeds."},
    {"id": "P-015", "text": "Check for memory leaks or performance degradation over extended use."}
  ],
  "UI": [
    {"id": "UI-001", "text": "Verify that layout and alignment of all elements are consistent across pages."},
    {"id": "UI-002", "text": "Check that fonts, font sizes, and styles are consistent and readable."},
    {"id": "UI-003", "text": "Verify that colors, backgrounds, and themes match design specifications."},
    {"id": "UI-004", "text": "Check that images, icons, and logos are displayed correctly and are not distorted."},
    {"id": "UI-005", "text": "Verify that buttons, links, and interactive elements are styled consistently."},
    {"id": "UI-006", "text": "Check hover, click, and focus states for buttons and links."},
    {"id": "UI-007", "text": "Verify spacing and padding between elements are consistent."},
    {"id": "UI-008", "text": "Check visibility and readability of text over backgrounds."},
    {"id": "UI-009", "text": "Verify alignment and positioning of elements on different screen sizes."},
    {"id": "UI-010", "text": "Check that modals, pop-ups, and tooltips appear correctly and are positioned properly."},
    {"id": "UI-011", "text": "Verify UI components are responsive and adapt to mobile, tablet, and desktop."},
    {"id": "UI-012", "text": "Check consistency of UI elements with the design mockups or style guide."},
    {"id": "UI-013", "text": "Verify that icons and buttons are intuitive and clearly represent their functions."},
    {"id": "UI-014", "text": "Check that scrollbars, tabs, and menus behave correctly and are visible when needed."},
    {"id": "UI-015", "text": "Verify that error, success, and information messages are displayed clearly and consistently."}
  ]
}